HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_EILS_Bits.CCLL */
#define IFX_ERAY_EILS_CCLL_OFF (5)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.CNAL */
#define IFX_ERAY_EILS_CNAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.CNAL */
#define IFX_ERAY_EILS_CNAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.CNAL */
#define IFX_ERAY_EILS_CNAL_OFF (1)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.EDAL */
#define IFX_ERAY_EILS_EDAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.EDAL */
#define IFX_ERAY_EILS_EDAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.EDAL */
#define IFX_ERAY_EILS_EDAL_OFF (16)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.EDBL */
#define IFX_ERAY_EILS_EDBL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.EDBL */
#define IFX_ERAY_EILS_EDBL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.EDBL */
#define IFX_ERAY_EILS_EDBL_OFF (24)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.EERRL */
#define IFX_ERAY_EILS_EERRL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.EERRL */
#define IFX_ERAY_EILS_EERRL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.EERRL */
#define IFX_ERAY_EILS_EERRL_OFF (6)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.EFAL */
#define IFX_ERAY_EILS_EFAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.EFAL */
#define IFX_ERAY_EILS_EFAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.EFAL */
#define IFX_ERAY_EILS_EFAL_OFF (8)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.IIBAL */
#define IFX_ERAY_EILS_IIBAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.IIBAL */
#define IFX_ERAY_EILS_IIBAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.IIBAL */
#define IFX_ERAY_EILS_IIBAL_OFF (9)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.IOBAL */
#define IFX_ERAY_EILS_IOBAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.IOBAL */
#define IFX_ERAY_EILS_IOBAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.IOBAL */
#define IFX_ERAY_EILS_IOBAL_OFF (10)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.LTVAL */
#define IFX_ERAY_EILS_LTVAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.LTVAL */
#define IFX_ERAY_EILS_LTVAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.LTVAL */
#define IFX_ERAY_EILS_LTVAL_OFF (17)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.LTVBL */
#define IFX_ERAY_EILS_LTVBL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.LTVBL */
#define IFX_ERAY_EILS_LTVBL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.LTVBL */
#define IFX_ERAY_EILS_LTVBL_OFF (25)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.MHFL */
#define IFX_ERAY_EILS_MHFL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.MHFL */
#define IFX_ERAY_EILS_MHFL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.MHFL */
#define IFX_ERAY_EILS_MHFL_OFF (11)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.PEMCL */
#define IFX_ERAY_EILS_PEMCL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.PEMCL */
#define IFX_ERAY_EILS_PEMCL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.PEMCL */
#define IFX_ERAY_EILS_PEMCL_OFF (0)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.RFOL */
#define IFX_ERAY_EILS_RFOL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.RFOL */
#define IFX_ERAY_EILS_RFOL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.RFOL */
#define IFX_ERAY_EILS_RFOL_OFF (7)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.SFBML */
#define IFX_ERAY_EILS_SFBML_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.SFBML */
#define IFX_ERAY_EILS_SFBML_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.SFBML */
#define IFX_ERAY_EILS_SFBML_OFF (2)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.SFOL */
#define IFX_ERAY_EILS_SFOL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.SFOL */
#define IFX_ERAY_EILS_SFOL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.SFOL */
#define IFX_ERAY_EILS_SFOL_OFF (3)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.TABAL */
#define IFX_ERAY_EILS_TABAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.TABAL */
#define IFX_ERAY_EILS_TABAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.TABAL */
#define IFX_ERAY_EILS_TABAL_OFF (18)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.TABBL */
#define IFX_ERAY_EILS_TABBL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.TABBL */
#define IFX_ERAY_EILS_TABBL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.TABBL */
#define IFX_ERAY_EILS_TABBL_OFF (26)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.CCF */
#define IFX_ERAY_EIR_CCF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.CCF */
#define IFX_ERAY_EIR_CCF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.CCF */
#define IFX_ERAY_EIR_CCF_OFF (4)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.CCL */
#define IFX_ERAY_EIR_CCL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.CCL */
#define IFX_ERAY_EIR_CCL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.CCL */
#define IFX_ERAY_EIR_CCL_OFF (5)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.CNA */
#define IFX_ERAY_EIR_CNA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.CNA */
#define IFX_ERAY_EIR_CNA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.CNA */
#define IFX_ERAY_EIR_CNA_OFF (1)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.EDA */
#define IFX_ERAY_EIR_EDA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EDA */
#define IFX_ERAY_EIR_EDA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EDA */
#define IFX_ERAY_EIR_EDA_OFF (16)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_OFF (24)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_OFF (6)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_OFF (8)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_LEN (1)

