HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND32 */
#define IFX_ERAY_NDAT2_ND32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND32 */
#define IFX_ERAY_NDAT2_ND32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND32 */
#define IFX_ERAY_NDAT2_ND32_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND33 */
#define IFX_ERAY_NDAT2_ND33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND33 */
#define IFX_ERAY_NDAT2_ND33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND33 */
#define IFX_ERAY_NDAT2_ND33_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND34 */
#define IFX_ERAY_NDAT2_ND34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND34 */
#define IFX_ERAY_NDAT2_ND34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND34 */
#define IFX_ERAY_NDAT2_ND34_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND35 */
#define IFX_ERAY_NDAT2_ND35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND35 */
#define IFX_ERAY_NDAT2_ND35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND35 */
#define IFX_ERAY_NDAT2_ND35_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND36 */
#define IFX_ERAY_NDAT2_ND36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND36 */
#define IFX_ERAY_NDAT2_ND36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND36 */
#define IFX_ERAY_NDAT2_ND36_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND37 */
#define IFX_ERAY_NDAT2_ND37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND37 */
#define IFX_ERAY_NDAT2_ND37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND37 */
#define IFX_ERAY_NDAT2_ND37_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND38 */
#define IFX_ERAY_NDAT2_ND38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND38 */
#define IFX_ERAY_NDAT2_ND38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND38 */
#define IFX_ERAY_NDAT2_ND38_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND39 */
#define IFX_ERAY_NDAT2_ND39_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND39 */
#define IFX_ERAY_NDAT2_ND39_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND39 */
#define IFX_ERAY_NDAT2_ND39_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND40 */
#define IFX_ERAY_NDAT2_ND40_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND40 */
#define IFX_ERAY_NDAT2_ND40_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND40 */
#define IFX_ERAY_NDAT2_ND40_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND41 */
#define IFX_ERAY_NDAT2_ND41_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND41 */
#define IFX_ERAY_NDAT2_ND41_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND41 */
#define IFX_ERAY_NDAT2_ND41_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND42 */
#define IFX_ERAY_NDAT2_ND42_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND42 */
#define IFX_ERAY_NDAT2_ND42_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND42 */
#define IFX_ERAY_NDAT2_ND42_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND43 */
#define IFX_ERAY_NDAT2_ND43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND43 */
#define IFX_ERAY_NDAT2_ND43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND43 */
#define IFX_ERAY_NDAT2_ND43_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND44 */
#define IFX_ERAY_NDAT2_ND44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND44 */
#define IFX_ERAY_NDAT2_ND44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND44 */
#define IFX_ERAY_NDAT2_ND44_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND45 */
#define IFX_ERAY_NDAT2_ND45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND45 */
#define IFX_ERAY_NDAT2_ND45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND45 */
#define IFX_ERAY_NDAT2_ND45_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND46 */
#define IFX_ERAY_NDAT2_ND46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND46 */
#define IFX_ERAY_NDAT2_ND46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND46 */
#define IFX_ERAY_NDAT2_ND46_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND47 */
#define IFX_ERAY_NDAT2_ND47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND47 */
#define IFX_ERAY_NDAT2_ND47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND47 */
#define IFX_ERAY_NDAT2_ND47_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND48 */
#define IFX_ERAY_NDAT2_ND48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND48 */
#define IFX_ERAY_NDAT2_ND48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND48 */
#define IFX_ERAY_NDAT2_ND48_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND49 */
#define IFX_ERAY_NDAT2_ND49_LEN (1)

