HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP27 */
#define IFX_ERAY_NDIC1_NDIP27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP27 */
#define IFX_ERAY_NDIC1_NDIP27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP27 */
#define IFX_ERAY_NDIC1_NDIP27_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP28 */
#define IFX_ERAY_NDIC1_NDIP28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP28 */
#define IFX_ERAY_NDIC1_NDIP28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP28 */
#define IFX_ERAY_NDIC1_NDIP28_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP29 */
#define IFX_ERAY_NDIC1_NDIP29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP29 */
#define IFX_ERAY_NDIC1_NDIP29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP29 */
#define IFX_ERAY_NDIC1_NDIP29_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP30 */
#define IFX_ERAY_NDIC1_NDIP30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP30 */
#define IFX_ERAY_NDIC1_NDIP30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP30 */
#define IFX_ERAY_NDIC1_NDIP30_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP31 */
#define IFX_ERAY_NDIC1_NDIP31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP31 */
#define IFX_ERAY_NDIC1_NDIP31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP31 */
#define IFX_ERAY_NDIC1_NDIP31_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP32 */
#define IFX_ERAY_NDIC2_NDIP32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP32 */
#define IFX_ERAY_NDIC2_NDIP32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP32 */
#define IFX_ERAY_NDIC2_NDIP32_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP33 */
#define IFX_ERAY_NDIC2_NDIP33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP33 */
#define IFX_ERAY_NDIC2_NDIP33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP33 */
#define IFX_ERAY_NDIC2_NDIP33_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP34 */
#define IFX_ERAY_NDIC2_NDIP34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP34 */
#define IFX_ERAY_NDIC2_NDIP34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP34 */
#define IFX_ERAY_NDIC2_NDIP34_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP35 */
#define IFX_ERAY_NDIC2_NDIP35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP35 */
#define IFX_ERAY_NDIC2_NDIP35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP35 */
#define IFX_ERAY_NDIC2_NDIP35_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP36 */
#define IFX_ERAY_NDIC2_NDIP36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP36 */
#define IFX_ERAY_NDIC2_NDIP36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP36 */
#define IFX_ERAY_NDIC2_NDIP36_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP37 */
#define IFX_ERAY_NDIC2_NDIP37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP37 */
#define IFX_ERAY_NDIC2_NDIP37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP37 */
#define IFX_ERAY_NDIC2_NDIP37_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP38 */
#define IFX_ERAY_NDIC2_NDIP38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP38 */
#define IFX_ERAY_NDIC2_NDIP38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP38 */
#define IFX_ERAY_NDIC2_NDIP38_OFF (6)

