HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_OFF (1)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_OFF (2)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_OFF (3)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_OFF (4)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_OFF (5)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_OFF (6)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_OFF (7)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_OFF (8)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_OFF (9)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_OFF (10)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_OFF (11)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_OFF (12)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_OFF (13)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_OFF (14)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_OFF (15)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_OFF (16)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_OFF (17)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_OFF (18)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR51 */
#define IFX_ERAY_TXRQ2_TXR51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR51 */
#define IFX_ERAY_TXRQ2_TXR51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR51 */
#define IFX_ERAY_TXRQ2_TXR51_OFF (19)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR52 */
#define IFX_ERAY_TXRQ2_TXR52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR52 */
#define IFX_ERAY_TXRQ2_TXR52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR52 */
#define IFX_ERAY_TXRQ2_TXR52_OFF (20)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_OFF (21)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_OFF (22)

