HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_OFF (15)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_OFF (16)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_OFF (17)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_OFF (18)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_OFF (19)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_OFF (20)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_OFF (21)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_OFF (22)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_OFF (23)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_OFF (24)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_OFF (25)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_OFF (26)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_OFF (27)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_OFF (28)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_OFF (29)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_OFF (30)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_OFF (31)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR100 */
#define IFX_ERAY_TXRQ4_TXR100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR100 */
#define IFX_ERAY_TXRQ4_TXR100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR100 */
#define IFX_ERAY_TXRQ4_TXR100_OFF (4)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR101 */
#define IFX_ERAY_TXRQ4_TXR101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR101 */
#define IFX_ERAY_TXRQ4_TXR101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR101 */
#define IFX_ERAY_TXRQ4_TXR101_OFF (5)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR102 */
#define IFX_ERAY_TXRQ4_TXR102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR102 */
#define IFX_ERAY_TXRQ4_TXR102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR102 */
#define IFX_ERAY_TXRQ4_TXR102_OFF (6)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR103 */
#define IFX_ERAY_TXRQ4_TXR103_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR103 */
#define IFX_ERAY_TXRQ4_TXR103_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR103 */
#define IFX_ERAY_TXRQ4_TXR103_OFF (7)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR104 */
#define IFX_ERAY_TXRQ4_TXR104_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR104 */
#define IFX_ERAY_TXRQ4_TXR104_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR104 */
#define IFX_ERAY_TXRQ4_TXR104_OFF (8)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR105 */
#define IFX_ERAY_TXRQ4_TXR105_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR105 */
#define IFX_ERAY_TXRQ4_TXR105_MSK (0x1)

